rails-intro/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    session[:ratings] = params[:ratings].keys unless params[:ratings].nil? || params[:ratings] == session[:ratings]
    session[:ratings] ||= @all_ratings
    @movies = Movie.where(rating: session[:ratings])
    @movies = @movies.order(params[:sort_by]) unless params[:sort_by].nil?
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."PG-13" = '1' AND "rating"."R" = '1'
SELECT "movies".* FROM "movies" WHERE 1=0 ORDER BY release_date